screen quast1:
    zorder 111
    text "Журнал" align(.172, .16)
    if qwest == 0:
        $text_qwest11 = ""
        $text_qwest12 = ""
    if qwest == 1:
        $text_qwest11 = "   - Добраться до подземелья, вход в которое находится за озером. И добыть целебное растение"
        $text_qwest12 = ""
    if qwest == 2:
        $text_qwest11 = "   - Д̶о̶б̶р̶а̶т̶ь̶с̶я̶ ̶д̶о̶ ̶п̶о̶д̶з̶е̶м̶е̶л̶ь̶я̶,̶ ̶в̶х̶о̶д̶ ̶в̶ ̶к̶о̶т̶о̶р̶о̶е̶ ̶н̶а̶х̶о̶д̶и̶т̶с̶я̶ ̶з̶а̶ ̶о̶з̶е̶р̶о̶м̶.̶ ̶И̶ ̶д̶о̶б̶ы̶т̶ь̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ \n   - Принести целебное растение алхимику в лавку"
        $text_qwest12 = ""
    if qwest == 3:
        $text_qwest11 = "   - Д̶о̶б̶р̶а̶т̶ь̶с̶я̶ ̶д̶о̶ ̶п̶о̶д̶з̶е̶м̶е̶л̶ь̶я̶,̶ ̶в̶х̶о̶д̶ ̶в̶ ̶к̶о̶т̶о̶р̶о̶е̶ ̶н̶а̶х̶о̶д̶и̶т̶с̶я̶ ̶з̶а̶ ̶о̶з̶е̶р̶о̶м̶.̶ ̶И̶ ̶д̶о̶б̶ы̶т̶ь̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ \n   - П̶р̶и̶н̶е̶с̶т̶и̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ ̶а̶л̶х̶и̶м̶и̶к̶у̶ ̶в̶ ̶л̶а̶в̶к̶у̶"
        $text_qwest12 = ""
    if qwest == 3:
        $text_qwest11 = "   - Д̶о̶б̶р̶а̶т̶ь̶с̶я̶ ̶д̶о̶ ̶п̶о̶д̶з̶е̶м̶е̶л̶ь̶я̶,̶ ̶в̶х̶о̶д̶ ̶в̶ ̶к̶о̶т̶о̶р̶о̶е̶ ̶н̶а̶х̶о̶д̶и̶т̶с̶я̶ ̶з̶а̶ ̶о̶з̶е̶р̶о̶м̶.̶ ̶И̶ ̶д̶о̶б̶ы̶т̶ь̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ \n   - П̶р̶и̶н̶е̶с̶т̶и̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ ̶а̶л̶х̶и̶м̶и̶к̶у̶ ̶в̶ ̶л̶а̶в̶к̶у̶"
        $text_qwest12 = "   - Добраться до места. отмеченного на карте и выкопать сундук."
    if qwest == 4:
        $text_qwest11 = "   - Д̶о̶б̶р̶а̶т̶ь̶с̶я̶ ̶д̶о̶ ̶п̶о̶д̶з̶е̶м̶е̶л̶ь̶я̶,̶ ̶в̶х̶о̶д̶ ̶в̶ ̶к̶о̶т̶о̶р̶о̶е̶ ̶н̶а̶х̶о̶д̶и̶т̶с̶я̶ ̶з̶а̶ ̶о̶з̶е̶р̶о̶м̶.̶ ̶И̶ ̶д̶о̶б̶ы̶т̶ь̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ \n   -  ̶П̶р̶и̶н̶е̶с̶т̶и̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ ̶а̶л̶х̶и̶м̶и̶к̶у̶ ̶в̶ ̶л̶а̶в̶к̶у̶"
        $text_qwest12 = "   - ̶Д̶о̶б̶р̶а̶т̶ь̶с̶я̶ ̶д̶о̶ ̶м̶е̶с̶т̶а̶.̶ ̶о̶т̶м̶е̶ч̶е̶н̶н̶о̶г̶о̶ ̶н̶а̶ ̶к̶а̶р̶т̶е̶ ̶и̶ ̶в̶ы̶к̶о̶п̶а̶т̶ь̶ ̶с̶у̶н̶д̶у̶к̶.\n   - Воспользуйтесь ключом, чтобы открыть сундук"
    if qwest == 5:
        $text_qwest11 = "   - Д̶о̶б̶р̶а̶т̶ь̶с̶я̶ ̶д̶о̶ ̶п̶о̶д̶з̶е̶м̶е̶л̶ь̶я̶,̶ ̶в̶х̶о̶д̶ ̶в̶ ̶к̶о̶т̶о̶р̶о̶е̶ ̶н̶а̶х̶о̶д̶и̶т̶с̶я̶ ̶з̶а̶ ̶о̶з̶е̶р̶о̶м̶.̶ ̶И̶ ̶д̶о̶б̶ы̶т̶ь̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ \n   -  ̶П̶р̶и̶н̶е̶с̶т̶и̶ ̶ц̶е̶л̶е̶б̶н̶о̶е̶ ̶р̶а̶с̶т̶е̶н̶и̶е̶ ̶а̶л̶х̶и̶м̶и̶к̶у̶ ̶в̶ ̶л̶а̶в̶к̶у̶"
        $text_qwest12 = "   - ̶Д̶о̶б̶р̶а̶т̶ь̶с̶я̶ ̶д̶о̶ ̶м̶е̶с̶т̶а̶.̶ ̶о̶т̶м̶е̶ч̶е̶н̶н̶о̶г̶о̶ ̶н̶а̶ ̶к̶а̶р̶т̶е̶ ̶и̶ ̶в̶ы̶к̶о̶п̶а̶т̶ь̶ ̶с̶у̶н̶д̶у̶к̶.\n   - В̶о̶с̶п̶о̶л̶ь̶з̶у̶й̶т̶е̶с̶ь̶ ̶к̶л̶ю̶ч̶о̶м̶,̶ ̶ч̶т̶о̶б̶ы̶ ̶о̶т̶к̶р̶ы̶т̶ь̶ ̶с̶у̶н̶д̶у̶к̶"
    frame:

        xalign 0.4
        background Solid("#0000")
        xmaximum 800
        ymaximum 1000
        xfill True
        vbox:
            imagebutton auto "inventory/book_%s.png" action SetVariable("book12", not book12)
            if book12:

                hbox:

                    #xmaximum 0.7

                    viewport id "box":
                        image "Quest/book.png"
                        # text "[text_qwest11]"
                        #yinitial 9999
                        #xmaximum 0.1
                        mousewheel True
                        draggable True
                        # frame:
                            # xpadding 10
                            # ypadding 10
                        vbox:
                            # viewport:
                            align (0.5, 0.1)
                            # null height 200
                            # text "[text_qwest11]"
                            # yinitial 1
                            # ymaximum 0.5
                            xmaximum 0.4
                            # mousewheel True
                            # draggable True
                            grid 2 1:
                                xspacing 50
                                text "[text_qwest11]" justify True color "#000000" italic True
                                text "[text_qwest12]" justify True color "#000000" italic True
